saki/app/controllers/comments_controller.rb

  def create
    tweet = Tweet.find(params[:tweet_id])
    @comment = tweet.comments.build(comment_params) #commentとtweet_idの二つを代入
    @comment.user_id = current_user.id
    if @comment.save
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 62 LIMIT 1
INSERT INTO `comments` (`comment`, `user_id`, `tweet_id`, `created_at`, `updated_at`) VALUES ('最高', 5, 62, '2020-09-23 00:30:55.210664', '2020-09-23 00:30:55.210664')