saki/app/controllers/likes_controller.rb

    def create
        @like = current_user.likes.create(tweet_id: params[:tweet_id])
---
INSERT INTO `likes` (`tweet_id`, `user_id`, `created_at`, `updated_at`) VALUES (37, 3, '2020-09-13 05:26:46.687527', '2020-09-13 05:26:46.687527')

    def destroy
        @like = Like.find_by(tweet_id: params[:tweet_id], user_id: current_user.id)
        @like.destroy
---
SELECT `likes`.* FROM `likes` WHERE `likes`.`tweet_id` = 37 AND `likes`.`user_id` = 3 LIMIT 1
DELETE FROM `likes` WHERE `likes`.`id` = 1