saki/app/controllers/loves_controller.rb

    def create
        @love = current_user.loves.create(post_id: params[:post_id])
---
INSERT INTO `loves` (`post_id`, `user_id`, `created_at`, `updated_at`) VALUES (11, 5, '2020-09-21 11:26:22.139060', '2020-09-21 11:26:22.139060')

    def destroy
        @love = Love.find_by(post_id: params[:post_id], user_id: current_user.id)
        @love.destroy
---
SELECT `loves`.* FROM `loves` WHERE `loves`.`post_id` = 11 AND `loves`.`user_id` = 5 LIMIT 1
DELETE FROM `loves` WHERE `loves`.`id` = 1