saki/app/controllers/posts_controller.rb

    def create
        @post =Post.new(post_params)
        @post.user_id = current_user.id
        if @post.save
---
INSERT INTO `posts` (`created_at`, `updated_at`, `title`, `body`, `user_id`) VALUES ('2020-09-21 11:08:54.523209', '2020-09-21 11:08:54.523209', 'いまとみ', '', 5)

    def edit
      @post =Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 11 LIMIT 1

    def update
        @post = Post.find(params[:id])
        if @post.update(post_params)
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 29 LIMIT 1
UPDATE `posts` SET `posts`.`body` = 'ささささいいいいいうううううわーい', `posts`.`updated_at` = '2020-10-02 05:40:54.024734' WHERE `posts`.`id` = 29

    def destroy
        Post.find(params[:id]).destroy
---
DELETE FROM `posts` WHERE `posts`.`id` = 3
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 3 LIMIT 1