saki/app/controllers/tweets_controller.rb

    def create
        @tweet = Tweet.new(tweet_params)
        @tweet.user_id = current_user.id
        if @tweet.save
---
INSERT INTO `tweets` (`created_at`, `updated_at`, `title`, `body`, `user_id`) VALUES ('2020-09-13 02:52:16.813233', '2020-09-13 02:52:16.813233', 'ショートカットを覚える', '仕事のスピードが上がる、手間が省ける', 3)

    def index
      @tweets = Tweet.all
---
SELECT `tweets`.* FROM `tweets`

    def show
      @tweet = Tweet.find(params[:id])
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 37 LIMIT 1

    def edit
      @tweet = Tweet.find(params[:id])
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 12 LIMIT 1

    def update
      @tweet = Tweet.find(params[:id])
      if @tweet.update(tweet_params)
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 12 LIMIT 1
UPDATE `tweets` SET `tweets`.`body` = 'わーい', `tweets`.`updated_at` = '2020-09-07 06:50:57.486120' WHERE `tweets`.`id` = 12

    def destroy
      Tweet.find(params[:id]).destroy
---
DELETE FROM `tweets` WHERE `tweets`.`id` = 37
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 37 LIMIT 1