saki/app/models/user.rb

  def already_liked?(tweet)
       self.likes.exists?(tweet_id: tweet.id)
---
SELECT 1 AS one FROM `likes` WHERE `likes`.`user_id` = 5 AND `likes`.`tweet_id` = 11 LIMIT 1

  def already_loved?(post)
       self.loves.exists?(post_id: post.id)
---
SELECT 1 AS one FROM `loves` WHERE `loves`.`user_id` = 5 AND `loves`.`post_id` = 11 LIMIT 1