saki/app/views/posts/index.html.erb

SELECT COUNT(*) FROM `loves` WHERE `loves`.`post_id` = 24
---
     <% if current_user.already_loved?(t) %>
        <i class="fas fa-heart"></i><%=t.loves.count%>