saki/app/views/posts/show.html.erb


  <h3>いいね件数: <%= @post.loves.count %></h3>
---
SELECT COUNT(*) FROM `loves` WHERE `loves`.`post_id` = 12