saki/app/views/tweets/index.html.erb

      <% if current_user.already_liked?(t) %>
         <i class="fas fa-heart"></i><%=t.likes.count%>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 62