saki/app/views/tweets/show.html.erb


<h3>いいね件数: <%= @tweet.likes.count %></h3>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 37

    <div>
      <%= c.user.email unless c.user.blank? %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1